meeting/minutes/2026/02-17.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 153 Minutes 2026-02-17</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 153 Minutes 2026-02-17</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/5]</code></a></li>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[9/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[1/10]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#close-without-action">1.6.3. Close without action</a></li>
<li><a href="#substantive">1.6.4. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#h-F7DE29C3-E195-4196-9A09-81D2E5F578E1">2.1. Improvements to FOS</a></li>
<li><a href="#h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7">2.2. Issue #2460: file:read-text and invalid XML characters</a></li>
<li><a href="#h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7">2.3. Other issue triage</a>
<ul>
<li><a href="#issue-77">2.3.1. #77 Allow manipulation of maps and arrays</a></li>
<li><a href="#issue-272">2.3.2. #272 Setting parameter values in xsl:use-package</a></li>
<li><a href="#issue-285">2.3.3. #285 Stability of collections</a></li>
<li><a href="#issue-540">2.3.4. #540 Add fn:system-property() to XQuery</a></li>
<li><a href="#issue-641">2.3.5. #641 Serialization fallback</a></li>
<li><a href="#issue-675">2.3.6. #675 XSLT streaming rules for new constructs</a></li>
<li><a href="#issue-1045">2.3.7. #1045 Functions to manage namespace usage</a></li>
<li><a href="#issue-1225">2.3.8. #1225 Generalization of Deep Updates</a></li>
<li><a href="#issue-1234">2.3.9. #1234 Seralization Parameters: Indentation, Whitespace, Newlines</a></li>
<li><a href="#issue-1251">2.3.10. 1251 Allow sequence constructor in extension instructions that are implemented with named templates</a></li>
<li><a href="#issue-1310">2.3.11. 1310 add fn:match-groups() function</a></li>
<li><a href="#issue-1459">2.3.12. 1459 Function properties and arities</a></li>
<li><a href="#issue-1479">2.3.13. 1479 Default element namespace in XQuery: interaction of 'fixed' and '##any'</a></li>
<li><a href="#issue-1506">2.3.14. 1506 Type declarations: Constructor functions?</a></li>
<li><a href="#issue-1528">2.3.15. 1528 Computed node constructors: observations</a></li>
<li><a href="#issue-1584">2.3.16. 1584 Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</a></li>
<li><a href="#issue-1679">2.3.17. 1697 Add documentary names to callback function signatures</a></li>
<li><a href="#issue-1702">2.3.18. 1702 Node Updates: Functions</a></li>
<li><a href="#issue-1777">2.3.19. 1777 Shallow copy in XSLT with maps and arrays</a></li>
<li><a href="#issue-1920">2.3.20. 1920 Parse functions: determinism</a></li>
<li><a href="#issue-1948">2.3.21. 1948 fn:element-to-map:</a></li>
<li><a href="#issue-1949">2.3.22. 1949 fn:element-to-map: Updated Feedback</a></li>
<li><a href="#issue-1979">2.3.23. 1979 Records: Type Safety</a></li>
<li><a href="#issue-2000">2.3.24. 2000 element-to-map() - type signature of plan</a></li>
<li><a href="#issue-2018">2.3.25. 2018 Type-checking the result of xsl:apply-templates</a></li>
<li><a href="#issue-2039">2.3.26. 2039 Generalize context item to context value in XSLT</a></li>
<li><a href="#issue-2052">2.3.27. 2052 fn:collation-available: $usage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-149-01: CG to draft a new PR with the common rule note.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-01: MK to fix the typo in the build-dateTime function.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-01: MK to investigate the indentation problem.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[9/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: DB.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> David J Birnbaum (DB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Alan Painter (AP</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/02-17.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/02-10.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 3 March 2026.
</p>

<p>
We <i>will not</i> meet on 24 February.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/10]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-149-01: CG to draft a new PR with the common rule note.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="on"><code>[X]</code> QT4CG-150-03: NW to setup an agenda item to review open issues</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-01: MK to fix the typo in the build-dateTime function.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
