meeting/minutes/2026/02-17.org
*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2313][#2313]]: 2298 XQFO rules: definition of default values
+ PR [[https://qt4cg.org/dashboard/#pr-2266][#2266]]: 540 system-property equivalent for XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2446][#2446]]: 2427 Add computed node constructors to XPath

Proposal: merge without discussion.

Accepted.

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2234][#2234]]: Replace `a/get(XX)` with `a/?(XX)`

Proposal: close with no further action.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2457][#2457]]: Improved use of fos:result
+ PR [[https://qt4cg.org/dashboard/#pr-2456][#2456]]: Stylesheet handling of fos:result/@narrative

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Improvements to FOS
:PROPERTIES:
:CUSTOM_ID: h-F7DE29C3-E195-4196-9A09-81D2E5F578E1
:END:

See PR [[https://qt4cg.org/dashboard/#pr-2457][#2457]] Improved use of fos:result, and
PR [[https://qt4cg.org/dashboard/#pr-2456][#2456]]: Stylesheet handling of fos:result/@narrative

MK introduces the infrastructure changes.

+ MK: We made a schema change to allow results in the function catalog to be
  annotated as narrative. A narrative result isn’t testable. The stylesheets
  handle that attribute; formatting without the code font. And when QT tests are
  generated from that example, we generate a “passing” test as long as it is
  syntactically valid.
  + … And #2457 makes use of that markup in the F&O function catalog.
  + … The next stage will be to apply it there as well.
+ JLO: We have now some narrative results, could we have both?
+ MK: For different examples of the same function. For a single result, you’d
  have to use the old mechanism.
+ CG: I like the change; editorially, the text may need to be adjusted with
  respect to indentation.

ACTION QT4CG-153-01: MK to investigate the indentation problem.

Proposal: accept this PR.

Approved.

** Issue #2460: file:read-text and invalid XML characters
:PROPERTIES:
:CUSTOM_ID: h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7
:END:

See issue [[https://github.com/qt4cg/qtspecs/issues/2460][#2460]]: file:read-text and invalid XML characters

Perhaps we can decide what needs to be done here.

+ MK: Sounds like it’s going the right way.
+ JLO: Looks nice; but should we have a single character type?
+ RD: We have a character, but it isn’t used in an XSD type.

Some discussion of codepoint vs. string vs. character.

+ CG: How do you represent a non-permitted character?

Ok, we do need to make it a code point!

+ CG: The return type should be untyped atomic. It gives you more flexibility.
+ NW: Okay.
+ JLO: Can we also replace it with nothing?
+ NW: I thought that was the empty string, but it’ll have to be ~xs:untypedAtomic?~

** Other issue triage
:PROPERTIES:
:CUSTOM_ID: h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7
:END:

NW proposes a three broad categories: close it; nice to have; leave it as is, we
have to do it. This is a coarse triage only.

+ JK: One small suggestion is to sort chronologically.
+ NW: Ok, then we start with #77.

*** #77 Allow manipulation of maps and arrays
:PROPERTIES:
:CUSTOM_ID: issue-77
:END:

See [[https://github.com/qt4cg/qtspecs/issues/77][#77]]

+ MK: There’s been a lot of work in this area, and more is needed, but it’s
  not clear if this is the right issue.

*** #272 Setting parameter values in xsl:use-package
:PROPERTIES:
:CUSTOM_ID: issue-272
:END:

See [[https://github.com/qt4cg/qtspecs/issues/272][#272]]

+ MK: It’s still nice to have.

*** #285 Stability of collections
:PROPERTIES:
:CUSTOM_ID: issue-285
:END:

See [[https://github.com/qt4cg/qtspecs/issues/285][#285]]

+ MK: As CG says, this is a minefield.
+ NW: Are we going to ship without it?
+ MK: Implementations have been pragmatic in the past and will probably continue to do so.
+ NW: Nice to have?

*** #540 Add fn:system-property() to XQuery
:PROPERTIES:
:CUSTOM_ID: issue-540
:END:

See [[https://github.com/qt4cg/qtspecs/issues/540][#540]]

+ MK: I tried to address this; but it didn’t go very well.
  + … We could extend the system function to sort out the difference between
    compile time and runtime propertiers.

*** #641 Serialization fallback
:PROPERTIES:
:CUSTOM_ID: issue-641
:END:

See [[https://github.com/qt4cg/qtspecs/issues/641][#641]]

+ NW: We’ve done some work on this.
+ MK: I think I’m going to propose dropping this one.

Marked close with out further action.

*** #675 XSLT streaming rules for new constructs
:PROPERTIES:
:CUSTOM_ID: issue-675
:END:

See [[https://github.com/qt4cg/qtspecs/issues/675][#675]]

This one has to be done.

