meeting/minutes/2026/02-17.html
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2313">#2313</a>: 2298 XQFO rules: definition of default values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2266">#2266</a>: 540 system-property equivalent for XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2446">#2446</a>: 2427 Add computed node constructors to XPath</li>
</ul>

<p>
Proposal: merge without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2234">#2234</a>: Replace `a/get(XX)` with `a/?(XX)`</li>
</ul>

<p>
Proposal: close with no further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2457">#2457</a>: Improved use of fos:result</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2456">#2456</a>: Stylesheet handling of fos:result/@narrative</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-h-F7DE29C3-E195-4196-9A09-81D2E5F578E1" class="outline-3">
<h3 id="h-F7DE29C3-E195-4196-9A09-81D2E5F578E1"><span class="section-number-3">2.1.</span> Improvements to FOS</h3>
<div class="outline-text-3" id="text-h-F7DE29C3-E195-4196-9A09-81D2E5F578E1">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2457">#2457</a> Improved use of fos:result, and
PR <a href="https://qt4cg.org/dashboard/#pr-2456">#2456</a>: Stylesheet handling of fos:result/@narrative
</p>

<p>
MK introduces the infrastructure changes.
</p>

<ul class="org-ul">
<li>MK: We made a schema change to allow results in the function catalog to be
annotated as narrative. A narrative result isn’t testable. The stylesheets
handle that attribute; formatting without the code font. And when QT tests are
generated from that example, we generate a “passing” test as long as it is
syntactically valid.
<ul class="org-ul">
<li>… And #2457 makes use of that markup in the F&amp;O function catalog.</li>
<li>… The next stage will be to apply it there as well.</li>
</ul></li>
<li>JLO: We have now some narrative results, could we have both?</li>
<li>MK: For different examples of the same function. For a single result, you’d
have to use the old mechanism.</li>
<li>CG: I like the change; editorially, the text may need to be adjusted with
respect to indentation.</li>
</ul>

<p>
ACTION QT4CG-153-01: MK to investigate the indentation problem.
</p>

<p>
Proposal: accept this PR.
</p>

<p>
Approved.
</p>
</div>
</div>
<div id="outline-container-h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7" class="outline-3">
<h3 id="h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7"><span class="section-number-3">2.2.</span> Issue #2460: <a href="read-text">read-text</a> and invalid XML characters</h3>
<div class="outline-text-3" id="text-h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/2460">#2460</a>: <a href="read-text">read-text</a> and invalid XML characters
</p>

<p>
Perhaps we can decide what needs to be done here.
</p>

<ul class="org-ul">
<li>MK: Sounds like it’s going the right way.</li>
<li>JLO: Looks nice; but should we have a single character type?</li>
<li>RD: We have a character, but it isn’t used in an XSD type.</li>
</ul>

<p>
Some discussion of codepoint vs. string vs. character.
</p>

<ul class="org-ul">
<li>CG: How do you represent a non-permitted character?</li>
</ul>

<p>
Ok, we do need to make it a code point!
</p>

<ul class="org-ul">
<li>CG: The return type should be untyped atomic. It gives you more flexibility.</li>
<li>NW: Okay.</li>
<li>JLO: Can we also replace it with nothing?</li>
<li>NW: I thought that was the empty string, but it’ll have to be <code>xs:untypedAtomic?</code></li>
</ul>
</div>
</div>
<div id="outline-container-h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7" class="outline-3">
<h3 id="h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7"><span class="section-number-3">2.3.</span> Other issue triage</h3>
<div class="outline-text-3" id="text-h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7">
<p>
NW proposes a three broad categories: close it; nice to have; leave it as is, we
have to do it. This is a coarse triage only.
</p>

<ul class="org-ul">
<li>JK: One small suggestion is to sort chronologically.</li>
<li>NW: Ok, then we start with #77.</li>
</ul>
</div>
<div id="outline-container-issue-77" class="outline-4">
<h4 id="issue-77"><span class="section-number-4">2.3.1.</span> #77 Allow manipulation of maps and arrays</h4>
<div class="outline-text-4" id="text-issue-77">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/77">#77</a>
</p>

<ul class="org-ul">
<li>MK: There’s been a lot of work in this area, and more is needed, but it’s
not clear if this is the right issue.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-272" class="outline-4">
<h4 id="issue-272"><span class="section-number-4">2.3.2.</span> #272 Setting parameter values in xsl:use-package</h4>
<div class="outline-text-4" id="text-issue-272">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>
</p>

<ul class="org-ul">
<li>MK: It’s still nice to have.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-285" class="outline-4">
<h4 id="issue-285"><span class="section-number-4">2.3.3.</span> #285 Stability of collections</h4>
<div class="outline-text-4" id="text-issue-285">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/285">#285</a>
</p>

<ul class="org-ul">
<li>MK: As CG says, this is a minefield.</li>
<li>NW: Are we going to ship without it?</li>
<li>MK: Implementations have been pragmatic in the past and will probably continue to do so.</li>
<li>NW: Nice to have?</li>
</ul>
</div>
</div>
<div id="outline-container-issue-540" class="outline-4">
<h4 id="issue-540"><span class="section-number-4">2.3.4.</span> #540 Add fn:system-property() to XQuery</h4>
<div class="outline-text-4" id="text-issue-540">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/540">#540</a>
</p>

<ul class="org-ul">
<li>MK: I tried to address this; but it didn’t go very well.
<ul class="org-ul">
<li>… We could extend the system function to sort out the difference between
compile time and runtime propertiers.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-issue-641" class="outline-4">
<h4 id="issue-641"><span class="section-number-4">2.3.5.</span> #641 Serialization fallback</h4>
<div class="outline-text-4" id="text-issue-641">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/641">#641</a>
</p>

<ul class="org-ul">
<li>NW: We’ve done some work on this.</li>
<li>MK: I think I’m going to propose dropping this one.</li>
</ul>

<p>
Marked close with out further action.
</p>
</div>
</div>
<div id="outline-container-issue-675" class="outline-4">
<h4 id="issue-675"><span class="section-number-4">2.3.6.</span> #675 XSLT streaming rules for new constructs</h4>
<div class="outline-text-4" id="text-issue-675">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>
</p>

<p>
This one has to be done.
</p>
</div>
</div>
