meeting/minutes/2026/02-17.org
*** #1045 Functions to manage namespace usage
:PROPERTIES:
:CUSTOM_ID: issue-1045
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]

+ MK: The problem of this one is the open-endedness of it. Do you do a very
  general thing or something more targeted?

Marked close with out further action.

*** #1225 Generalization of Deep Updates
:PROPERTIES:
:CUSTOM_ID: issue-1225
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1225][#1225]]

+ MK: We have the problem about the status of the XQuery Update spec; if we’re
  doing anything on that specification, we need to do housekeeping to bring it
  in line with the specs. XQuery Update 3.0 was abandoned.

Marked close with out further action.

*** #1234 Seralization Parameters: Indentation, Whitespace, Newlines
:PROPERTIES:
:CUSTOM_ID: issue-1234
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1234][#1234]]

+ CG: I’ll try to write a PR for this one. Many implementations have ways of
  doing this.

*** 1251 Allow sequence constructor in extension instructions that are implemented with named templates
:PROPERTIES:
:CUSTOM_ID: issue-1251
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1251][#1251]]

Marked close with out further action.

*** 1310 add fn:match-groups() function
:PROPERTIES:
:CUSTOM_ID: issue-1310
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1310][#1310]]

+ MK: The ~fn:analyze-string~ function was an intent to do this; but it relies
  on an XML representation of the results.
  + … The aim here would be a single function that gives you all the data in the
    form of maps of arrays.
+ JWL: Can this be written entirely in XPath?
+ MK: You might have to apply the regex more than once; and there are things
  that aren’t easily available like “how many groups are there?”

*** 1459 Function properties and arities
:PROPERTIES:
:CUSTOM_ID: issue-1459
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1459][#1459]]

+ CG: The properties don’t reflect what’s currently available.

*** 1479 Default element namespace in XQuery: interaction of 'fixed' and '##any'
:PROPERTIES:
:CUSTOM_ID: issue-1479
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1479][#1479]]

+ MK: I think there’s a potential bug here; we should come back to it.

*** 1506 Type declarations: Constructor functions?
:PROPERTIES:
:CUSTOM_ID: issue-1506
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1506][#1506]]

+ CG: For record declarations, we have implicit constructor functions. Do we
  want to have something similar for things like enums?
+ MK: I think that creates a false impression that enums are more strongly typed
  than they are.

Marked close with out further action.

*** 1528 Computed node constructors: observations
:PROPERTIES:
:CUSTOM_ID: issue-1528
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1528][#1528]]

+ CG: Mostly this is about shortening the list of excluded keywords.
+ MK: That’s certainly a much nicer list.
+ NW: Can we test this?
+ MK: Verifying that this is a complete maximal and minimal list is much harder to check.

Leave it the way it is.

*** 1584 Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
:PROPERTIES:
:CUSTOM_ID: issue-1584
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]

+ NW: Before we’re done, we’ll have to check this with care.

*** 1697 Add documentary names to callback function signatures
:PROPERTIES:
:CUSTOM_ID: issue-1679
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1679][#1679]]

+ MK: This is an editorial suggestion.

Leave it the way it is. (It’s marked nice to have.)

+ JWL: We have to be very careful that we don’t give users the impression that
  they can use them as keyword arguments.
+ NW: That suggests a different rendering of some sort.

*** 1702 Node Updates: Functions
:PROPERTIES:
:CUSTOM_ID: issue-1702
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1702][#1702]]

Marked close with out further action.

*** 1777 Shallow copy in XSLT with maps and arrays
:PROPERTIES:
:CUSTOM_ID: issue-1777
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]

+ MK: We must do this.

*** 1920 Parse functions: determinism
:PROPERTIES:
:CUSTOM_ID: issue-1920
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1920][#1920]]

Consensus we should just do it.

*** 1948 fn:element-to-map:
:PROPERTIES:
:CUSTOM_ID: issue-1948
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1948][#1948]]

+ MK: We’ve made some progress on this, but I’m not sure of the status.

Leave it the way it is.

*** 1949 fn:element-to-map: Updated Feedback
:PROPERTIES:
:CUSTOM_ID: issue-1949
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1949][#1949]]

Leave it the way it is.

ACTION QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.

*** 1979 Records: Type Safety
:PROPERTIES:
:CUSTOM_ID: issue-1979
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1979][#1979]]

+ CG: Now that records aren’t extensible, we can close this?
+ MK: The main thing is updates; do you want to have a restriction that you
  can’t update the record?

Nice to have.

*** 2000 element-to-map() - type signature of plan
:PROPERTIES:
:CUSTOM_ID: issue-2000
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2000][#2000]]

Nice to have.

*** 2018 Type-checking the result of xsl:apply-templates
:PROPERTIES:
:CUSTOM_ID: issue-2018
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2018][#2018]]

+ MK: I’m going to do more work in this area. We can drop this as a separate issues.

*** 2039 Generalize context item to context value in XSLT
:PROPERTIES:
:CUSTOM_ID: issue-2039
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2039][#2039]]

+ NW: How is this only a nice to have?
+ MK: We have restrictions in various places about the item type when you call a
  template.
  + … The spec is coherent, but it’s a bit odd that context values can be
    generalized in some places but not other.

