meeting/minutes/2026/02-17.html
<div id="outline-container-issue-1045" class="outline-4">
<h4 id="issue-1045"><span class="section-number-4">2.3.7.</span> #1045 Functions to manage namespace usage</h4>
<div class="outline-text-4" id="text-issue-1045">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>
</p>

<ul class="org-ul">
<li>MK: The problem of this one is the open-endedness of it. Do you do a very
general thing or something more targeted?</li>
</ul>

<p>
Marked close with out further action.
</p>
</div>
</div>
<div id="outline-container-issue-1225" class="outline-4">
<h4 id="issue-1225"><span class="section-number-4">2.3.8.</span> #1225 Generalization of Deep Updates</h4>
<div class="outline-text-4" id="text-issue-1225">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1225">#1225</a>
</p>

<ul class="org-ul">
<li>MK: We have the problem about the status of the XQuery Update spec; if we’re
doing anything on that specification, we need to do housekeeping to bring it
in line with the specs. XQuery Update 3.0 was abandoned.</li>
</ul>

<p>
Marked close with out further action.
</p>
</div>
</div>
<div id="outline-container-issue-1234" class="outline-4">
<h4 id="issue-1234"><span class="section-number-4">2.3.9.</span> #1234 Seralization Parameters: Indentation, Whitespace, Newlines</h4>
<div class="outline-text-4" id="text-issue-1234">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1234">#1234</a>
</p>

<ul class="org-ul">
<li>CG: I’ll try to write a PR for this one. Many implementations have ways of
doing this.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-1251" class="outline-4">
<h4 id="issue-1251"><span class="section-number-4">2.3.10.</span> 1251 Allow sequence constructor in extension instructions that are implemented with named templates</h4>
<div class="outline-text-4" id="text-issue-1251">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1251">#1251</a>
</p>

<p>
Marked close with out further action.
</p>
</div>
</div>
<div id="outline-container-issue-1310" class="outline-4">
<h4 id="issue-1310"><span class="section-number-4">2.3.11.</span> 1310 add fn:match-groups() function</h4>
<div class="outline-text-4" id="text-issue-1310">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1310">#1310</a>
</p>

<ul class="org-ul">
<li>MK: The <code>fn:analyze-string</code> function was an intent to do this; but it relies
on an XML representation of the results.
<ul class="org-ul">
<li>… The aim here would be a single function that gives you all the data in the
form of maps of arrays.</li>
</ul></li>
<li>JWL: Can this be written entirely in XPath?</li>
<li>MK: You might have to apply the regex more than once; and there are things
that aren’t easily available like “how many groups are there?”</li>
</ul>
</div>
</div>
<div id="outline-container-issue-1459" class="outline-4">
<h4 id="issue-1459"><span class="section-number-4">2.3.12.</span> 1459 Function properties and arities</h4>
<div class="outline-text-4" id="text-issue-1459">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1459">#1459</a>
</p>

<ul class="org-ul">
<li>CG: The properties don’t reflect what’s currently available.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-1479" class="outline-4">
<h4 id="issue-1479"><span class="section-number-4">2.3.13.</span> 1479 Default element namespace in XQuery: interaction of 'fixed' and '##any'</h4>
<div class="outline-text-4" id="text-issue-1479">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1479">#1479</a>
</p>

<ul class="org-ul">
<li>MK: I think there’s a potential bug here; we should come back to it.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-1506" class="outline-4">
<h4 id="issue-1506"><span class="section-number-4">2.3.14.</span> 1506 Type declarations: Constructor functions?</h4>
<div class="outline-text-4" id="text-issue-1506">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1506">#1506</a>
</p>

<ul class="org-ul">
<li>CG: For record declarations, we have implicit constructor functions. Do we
want to have something similar for things like enums?</li>
<li>MK: I think that creates a false impression that enums are more strongly typed
than they are.</li>
</ul>

<p>
Marked close with out further action.
</p>
</div>
</div>
<div id="outline-container-issue-1528" class="outline-4">
<h4 id="issue-1528"><span class="section-number-4">2.3.15.</span> 1528 Computed node constructors: observations</h4>
<div class="outline-text-4" id="text-issue-1528">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1528">#1528</a>
</p>

<ul class="org-ul">
<li>CG: Mostly this is about shortening the list of excluded keywords.</li>
<li>MK: That’s certainly a much nicer list.</li>
<li>NW: Can we test this?</li>
<li>MK: Verifying that this is a complete maximal and minimal list is much harder to check.</li>
</ul>

<p>
Leave it the way it is.
</p>
</div>
</div>
<div id="outline-container-issue-1584" class="outline-4">
<h4 id="issue-1584"><span class="section-number-4">2.3.16.</span> 1584 Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</h4>
<div class="outline-text-4" id="text-issue-1584">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>
</p>

<ul class="org-ul">
<li>NW: Before we’re done, we’ll have to check this with care.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-1679" class="outline-4">
<h4 id="issue-1679"><span class="section-number-4">2.3.17.</span> 1697 Add documentary names to callback function signatures</h4>
<div class="outline-text-4" id="text-issue-1679">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1679">#1679</a>
</p>

<ul class="org-ul">
<li>MK: This is an editorial suggestion.</li>
</ul>

<p>
Leave it the way it is. (It’s marked nice to have.)
</p>

<ul class="org-ul">
<li>JWL: We have to be very careful that we don’t give users the impression that
they can use them as keyword arguments.</li>
<li>NW: That suggests a different rendering of some sort.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-1702" class="outline-4">
<h4 id="issue-1702"><span class="section-number-4">2.3.18.</span> 1702 Node Updates: Functions</h4>
<div class="outline-text-4" id="text-issue-1702">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1702">#1702</a>
</p>

<p>
Marked close with out further action.
</p>
</div>
</div>
<div id="outline-container-issue-1777" class="outline-4">
<h4 id="issue-1777"><span class="section-number-4">2.3.19.</span> 1777 Shallow copy in XSLT with maps and arrays</h4>
<div class="outline-text-4" id="text-issue-1777">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>
</p>

<ul class="org-ul">
<li>MK: We must do this.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-1920" class="outline-4">
<h4 id="issue-1920"><span class="section-number-4">2.3.20.</span> 1920 Parse functions: determinism</h4>
<div class="outline-text-4" id="text-issue-1920">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1920">#1920</a>
</p>

<p>
Consensus we should just do it.
</p>
</div>
</div>
<div id="outline-container-issue-1948" class="outline-4">
<h4 id="issue-1948"><span class="section-number-4">2.3.21.</span> 1948 fn:element-to-map:</h4>
<div class="outline-text-4" id="text-issue-1948">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1948">#1948</a>
</p>

<ul class="org-ul">
<li>MK: We’ve made some progress on this, but I’m not sure of the status.</li>
</ul>

<p>
Leave it the way it is.
</p>
</div>
</div>
<div id="outline-container-issue-1949" class="outline-4">
<h4 id="issue-1949"><span class="section-number-4">2.3.22.</span> 1949 fn:element-to-map: Updated Feedback</h4>
<div class="outline-text-4" id="text-issue-1949">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1949">#1949</a>
</p>

<p>
Leave it the way it is.
</p>

<p>
ACTION QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.
</p>
</div>
</div>
<div id="outline-container-issue-1979" class="outline-4">
<h4 id="issue-1979"><span class="section-number-4">2.3.23.</span> 1979 Records: Type Safety</h4>
<div class="outline-text-4" id="text-issue-1979">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1979">#1979</a>
</p>

<ul class="org-ul">
<li>CG: Now that records aren’t extensible, we can close this?</li>
<li>MK: The main thing is updates; do you want to have a restriction that you
can’t update the record?</li>
</ul>

<p>
Nice to have.
</p>
</div>
</div>
<div id="outline-container-issue-2000" class="outline-4">
<h4 id="issue-2000"><span class="section-number-4">2.3.24.</span> 2000 element-to-map() - type signature of plan</h4>
<div class="outline-text-4" id="text-issue-2000">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2000">#2000</a>
</p>

<p>
Nice to have.
</p>
</div>
</div>
<div id="outline-container-issue-2018" class="outline-4">
<h4 id="issue-2018"><span class="section-number-4">2.3.25.</span> 2018 Type-checking the result of xsl:apply-templates</h4>
<div class="outline-text-4" id="text-issue-2018">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2018">#2018</a>
</p>

<ul class="org-ul">
<li>MK: I’m going to do more work in this area. We can drop this as a separate issues.</li>
</ul>
</div>
</div>
<div id="outline-container-issue-2039" class="outline-4">
<h4 id="issue-2039"><span class="section-number-4">2.3.26.</span> 2039 Generalize context item to context value in XSLT</h4>
<div class="outline-text-4" id="text-issue-2039">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2039">#2039</a>
</p>

<ul class="org-ul">
<li>NW: How is this only a nice to have?</li>
<li>MK: We have restrictions in various places about the item type when you call a
template.
<ul class="org-ul">
<li>… The spec is coherent, but it’s a bit odd that context values can be
generalized in some places but not other.</li>
</ul></li>
</ul>
</div>
</div>
