meeting/minutes/2026/02-17.org
*** 2052 fn:collation-available: $usage
:PROPERTIES:
:CUSTOM_ID: issue-2052
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2052][#2052]]

+ CG: I have no idea how to implement this.
  + … I’ll raise a PR to drop it.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.
