meeting/minutes/2026/02-17.html
<div id="outline-container-issue-2052" class="outline-4">
<h4 id="issue-2052"><span class="section-number-4">2.3.27.</span> 2052 fn:collation-available: $usage</h4>
<div class="outline-text-4" id="text-issue-2052">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2052">#2052</a>
</p>

<ul class="org-ul">
<li>CG: I have no idea how to implement this.
<ul class="org-ul">
<li>… I’ll raise a PR to drop it.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
